---
kind: property
id: P:Autodesk.Revit.DB.FabricationConfigurationInfo.IsLocked
source: html/bee1d753-b076-854a-d51d-d22ea938f53b.htm
---
# Autodesk.Revit.DB.FabricationConfigurationInfo.IsLocked Property

Checks whether the fabrication configuration is locked. If true, the configuration is locked and cannot be removed.

## Syntax (C#)
```csharp
public bool IsLocked { get; }
```